Revit 2024 API
BuiltInFailures.MEPFabricationFailures.CannotConvertFlexPipeToPart Property
 Cannot convert flex pipe to fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotConvertFlexPipeToPart { get; }
Visual Basic
Public Shared ReadOnly Property CannotConvertFlexPipeToPart As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotConvertFlexPipeToPart {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace